zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
static osStatus file_transfer_start(jd_om_comm *hdl,char *file_name)
{
	osStatus ret = osOK;
	FRESULT error;
	unsigned char file_Dev = SYSDISK;

	recv_file_des.packet_id = 0;
	recv_file_des.offset = 0;

	snprintf(recv_file_des.file_path,MAX_FILE_PATH_SIZE,"%s/%s", TMP_FILE_DIR,file_name);
	if(recv_file_des.type == upgrade_file){

	}
	else if(recv_file_des.type == schedule_file){

	}
	else if(recv_file_des.type == picture_file){

	}
	else if(recv_file_des.type == voice_file){
		#ifdef PRIVATE_MP3_FLASH_FS
		//save to tmp of sysdisk
		#else
		file_Dev = MP3DISK;
		#endif
	}
	else{
		dzlog_error("recv unknown file type %d\r\n",recv_file_des.type);
		ret = osErrorOS;
		goto RESPONSE;
	}

	if (0 >= recv_file_des.size) {
		dzlog_error("recv slave update file size error\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	error = ff_open(file_Dev,&(recv_file_des.file_handle),_T(recv_file_des.file_path), (FA_WRITE | FA_READ | FA_CREATE_ALWAYS));
	if (error) {
        if (error == FR_EXIST)
        {
            dzlog_error("File exists.\r\n");
        }
        else
        {
            dzlog_error("Open file failed.\r\n");
        }
		dzlog_error("slave create update file fail[file_name=%s,error=%d]\r\n",recv_file_des.file_path,error);
		ret = osErrorOS;
		goto RESPONSE;
	}

	f_lseek(&(recv_file_des.file_handle), 0U);

RESPONSE:
	{
		int payload_size = sizeof(RES_TRANS_FILE_HEAD_T);
		int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
		MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

		pkt->head.start = START_CMD;
		pkt->head.slave = SLAVE_1;
		pkt->head.type = RES_TRANS_FILE_HEAD;
		pkt->head.payload_len = payload_size;

		RES_TRANS_FILE_HEAD_T res;
		res.code = ret;
		memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), &res, payload_size);

		unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
		memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

		return jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	}
}

static osStatus file_transfer_going(jd_om_comm *hdl,unsigned packet_id, char *data, unsigned len)
{
	osStatus ret = osOK;
	FRESULT error;
	UINT bytesWritten;

	if ((packet_id != recv_file_des.packet_id + 1) &&
	    (!(0 == packet_id && 0 == recv_file_des.packet_id))) {
		dzlog_error("slave update packet id err\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	f_lseek(&(recv_file_des.file_handle), recv_file_des.offset);
	error = f_write_decrypted_aes_data(hdl,&(recv_file_des.file_handle), data, len, &bytesWritten);
	//error = f_write(&(recv_file_des.file_handle), data, len, &bytesWritten);
	if ((error)/* || (len != bytesWritten)*/) {
		dzlog_error("slave update write file err\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	recv_file_des.packet_id = packet_id;
	recv_file_des.offset += bytesWritten;

	dzlog_debug("file download progress: %d/%d packet_id %d\r\n", recv_file_des.offset, recv_file_des.size, packet_id);

RESPONSE:
	{
		int payload_size = sizeof(RES_TRANS_FILE_DATA_T);
		int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
		MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

		pkt->head.start = START_CMD;
		pkt->head.slave = SLAVE_1;
		pkt->head.type = RES_TRANS_FILE_DATA;
		pkt->head.payload_len = payload_size;

		RES_TRANS_FILE_DATA_T res;
		res.packet_id = packet_id;
		res.code = ret;
		memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), &res, payload_size);

		unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
		memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

		return jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	}
}

static osStatus file_transfer_end(jd_om_comm *hdl)
{
	int restart_sec = 3;
	osStatus ret = osOK;
	unsigned char md5[MD5_SIZE] = { 0 };
	#ifdef PRIVATE_MP3_FLASH_FS
	unsigned char file_Dev = SYSDISK;
	#else
	unsigned char file_Dev = (recv_file_des.type == voice_file)?MP3DISK:SYSDISK;
	#endif

	dzlog_debug("slave update end\r\n");
	f_sync(&(recv_file_des.file_handle));
	f_close(&(recv_file_des.file_handle));
	get_md5(file_Dev,md5, recv_file_des.file_path, 0);

	dzlog_debug("%s:[file_size=%d,padding_len=%d]\r\n",__func__,
		recv_file_des.size,recv_file_des.aes_padding_len);
	if ((recv_file_des.size-recv_file_des.aes_padding_len) != get_file_size(file_Dev,recv_file_des.file_path)) {
		dzlog_error("slave update file size wrong\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	if (0 != memcmp(md5, recv_file_des.md5, MD5_SIZE)) {
		dzlog_error("slave update file md5 wrong\r\n");
		ret = osErrorOS;
	}

	if(ret == osOK)
		file_move_to_destination(recv_file_des.file_path,(FileType)(recv_file_des.type));

	if((ret == osOK)/* && (recv_file_des.type == schedule_file)*/){
		//notify a file transfering completed!
		jd_master_com_send_play_msg(hdl,REQ_TRANS_FILE_END,NULL);
	}

RESPONSE:
	{
		dzlog_debug("slave end\r\n");
		int payload_size = sizeof(RES_TRANS_FILE_END_T);
		int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
		MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

		pkt->head.start = START_CMD;
		pkt->head.slave = SLAVE_1;
		pkt->head.type = RES_TRANS_FILE_END;
		pkt->head.payload_len = payload_size;

		RES_TRANS_FILE_END_T res;
		res.code = ret;
		memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), &res, payload_size);

		unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
		memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

		ret = jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);

		if ((0 == res.code) && (recv_file_des.type == upgrade_file)) {
			dzlog_debug("%s:recv upgrade file completed !\r\n",__func__);
			jd_om_msleep(1000);	//wait host get the response.
			//TODO:set a new bin flag to eeprom to notify boot entry upgrade mode here!
			if(copy_upgrade_file_to_flash(recv_file_des.file_path) != osOK){
				debug("upgrade err\n");
			}
			else{
				set_upgrade_flag();
				dbinfo("upgrade suc\r\n");
				dbinfo("System will reboot in 3s\r\n");
				do{
					dbinfo("%d...\r\n", restart_sec);
					restart_sec--;
					jd_om_msleep(1000);
				}while(restart_sec > 0);
				dbinfo("\r\n===>>>reboot now\r\n");
				__disable_irq();
				__set_PSP(0x20018000);
				EMC_Deinit(EMC);
				ispPinInit();
				system_reset();
			}
		}

		if(res.code != osOK){
			dzlog_error("#####%s:start to delete bad file '%s'#####\r\n",__func__,recv_file_des.file_path);
			ff_unlink(file_Dev,recv_file_des.file_path);
		}
		memset(recv_file_des.version,0,4);
		memset(recv_file_des.file_path, 0, MAX_FILE_PATH_SIZE);
		recv_file_des.type = 0;
		recv_file_des.size = 0;
		recv_file_des.packet_id = 0;
		recv_file_des.offset = 0;
		recv_file_des.size = 0;
		recv_file_des.aes_padding_len = 0;
		memset(recv_file_des.md5, 0, MD5_SIZE);

		return ret;
	}
}
#endif
static osStatus jd_master_com_send_play_msg(jd_om_comm *hdl,unsigned char type, void *req_data)
{
	pic_play_msg *msg = NULL;

	switch (type){
		case REQ_SHOW:
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_service_code;
			msg->msg.info_service_code.service_code = (play_service_code)(((REQ_SHOW_T *)req_data)->service_code);
			msg->msg.info_service_code.timeout = ((REQ_SHOW_T *)req_data)->keep_alive;
			break;

		case REQ_SET_VOLUME:
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_key_pushed;
			msg->msg.info_key.fromIsr = false;
			msg->msg.info_key.value = key_pushed_vol;
			msg->msg.info_key.volume = (voice_volume_level)(((REQ_SET_VOLUME_T *)req_data)->volume);
			break;

