zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
		case REQ_TRANS_FILE_HEAD:
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_file_update_start;

			msg->msg.info_file.type = ((REQ_TRANS_FILE_HEAD_T *)req_data)->type;

			memset(msg->msg.info_file.file_name,0,sizeof(msg->msg.info_file.file_name));
			memcpy(msg->msg.info_file.file_name,((REQ_TRANS_FILE_HEAD_T *)req_data)->file_name,64);
			memcpy(msg->msg.info_file.md5,((REQ_TRANS_FILE_HEAD_T *)req_data)->md5,MD5_SIZE);
			break;

		case REQ_TRANS_FILE_END:	//file transfering completed!
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_file_update_end;
			msg->msg.info_file.type = recv_file_des.type;
			memset(msg->msg.info_file.file_name,0,sizeof(msg->msg.info_file.file_name));
			snprintf(msg->msg.info_file.file_name,64,"%s",strrchr(recv_file_des.file_path,'/')+1);
			break;

		case REQ_NOTIFY_ALL_FILE_COMPLETED:
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_all_file_update_end;
			break;

		default:
			dzlog_error("%s:unknown type=%d.\r\n",__func__,type);
			break;
	}

	if(msg){
		jd_om_mq_send(&(hdl->uart_comm_des.play_queue), msg);
		//wait play task to set responsed
		jd_om_sem_wait(&(hdl->uart_comm_des.sem),0);
		return osOK;
	}
	return osErrorOS;
}

static osStatus jd_master_com_send_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	unsigned int material_num = 0;
	osStatus ret;

	switch (type) {
	case REQ_DEVICE_INFO:
	{
		res_type = RES_DEVICE_INFO;
		material_num = ((RES_DEVICE_INFO_T *)data)->schedule.material_num;
		payload_size = sizeof(RES_DEVICE_INFO_T) + material_num*sizeof(AdvMaterialInfo);
		break;
	}

	case REQ_CONFIG_PASSWORD:
	{
		res_type = RES_CONFIG_PASSWORD;
		payload_size = sizeof(RES_CONFIG_PASSWORD_T);
		break;
	}

	case REQ_GET_TIME:
	{
		res_type = RES_GET_TIME;
		payload_size = sizeof(RES_GET_TIME_T);
		break;
	}

	case REQ_SET_TIME:
	{
		res_type = RES_SET_TIME;
		payload_size = sizeof(RES_SET_TIME_T);
		break;
	}

	case REQ_SET_VOLUME:
	{
		res_type = RES_SET_VOLUME;
		payload_size = sizeof(RES_SET_VOLUME_T);
		break;
	}

	case REQ_CLEAR_PASSWORD:
	{
		res_type = RES_CLEAR_PASSWORD;
		payload_size = sizeof(RES_CLEAR_PASSWORD_T);
		break;
	}

	case REQ_SHOW:
	{
		res_type = RES_SHOW;
		payload_size = sizeof(RES_SHOW_T);
		break;
	}

	case REQ_NOTIFY_ALL_FILE_COMPLETED:
	{
		res_type = RES_NOTIFY_ALL_FILE_COMPLETED;
		payload_size = sizeof(RES_NOTIFY_ALL_FILE_COMPLETED_T);
		break;
	}

	case REQ_SET_SN:
	{
		res_type = RES_SET_SN;
		payload_size = sizeof(RES_SET_SN_T);
		break;
	}

	case REQ_SET_DEVICE_ID:
	{
		res_type = RES_SET_DEVICE_ID;
		payload_size = sizeof(RES_SET_DEVICE_ID_T);
		break;
	}

	default:
		return osErrorOS;
	}

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);

	return ret;
}

static osStatus jd_master_com_send_exception_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	osStatus ret;

	res_type = (type&0x0F)|0xA0;
	payload_size = sizeof(RES_COMMON_T);

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);

	return ret;
}


#define SECONDS_IN_A_DAY (86400U)
#define SECONDS_IN_A_HOUR (3600U)
#define SECONDS_IN_A_MINUTE (60U)
#define DAYS_IN_A_YEAR (365U)
#define YEAR_RANGE_START (1970U)
#define YEAR_RANGE_END (2099U)
#if 0
static void RTC_ConvertSecondsToDatetime(uint32_t seconds, rtc_datetime_t *datetime)
{
    assert(datetime);

    uint32_t x;
    uint32_t secondsRemaining, days;
    uint16_t daysInYear;
    /* Table of days in a month for a non leap year. First entry in the table is not used,
     * valid months start from 1
     */
    uint8_t daysPerMonth[] = {0U, 31U, 28U, 31U, 30U, 31U, 30U, 31U, 31U, 30U, 31U, 30U, 31U};

    /* Start with the seconds value that is passed in to be converted to date time format */
    secondsRemaining = seconds;

    /* Calcuate the number of days, we add 1 for the current day which is represented in the
     * hours and seconds field
     */
    days = secondsRemaining / SECONDS_IN_A_DAY + 1;

    /* Update seconds left*/
    secondsRemaining = secondsRemaining % SECONDS_IN_A_DAY;

    /* Calculate the datetime hour, minute and second fields */
    datetime->hour = secondsRemaining / SECONDS_IN_A_HOUR;
    secondsRemaining = secondsRemaining % SECONDS_IN_A_HOUR;
    datetime->minute = secondsRemaining / 60U;
    datetime->second = secondsRemaining % SECONDS_IN_A_MINUTE;

    /* Calculate year */
    daysInYear = DAYS_IN_A_YEAR;
    datetime->year = YEAR_RANGE_START;
    while (days > daysInYear)
    {
        /* Decrease day count by a year and increment year by 1 */
        days -= daysInYear;
        datetime->year++;

        /* Adjust the number of days for a leap year */
        if (datetime->year & 3U)
        {
            daysInYear = DAYS_IN_A_YEAR;
        }
        else
        {
            daysInYear = DAYS_IN_A_YEAR + 1;
        }
    }

    /* Adjust the days in February for a leap year */
    if (!(datetime->year & 3U))
    {
        daysPerMonth[2] = 29U;
    }

    for (x = 1U; x <= 12U; x++)
    {
        if (days <= daysPerMonth[x])
        {
            datetime->month = x;
            break;
        }
        else
        {
            days -= daysPerMonth[x];
        }
    }

    datetime->day = days;
}

static void jd_master_com_set_system_time(uint32_t timeSeconds)
{
	rtc_datetime_t date;
	uint32_t seconds = 0;

	seconds = timeSeconds + (60*60*8);	//transfer UTC to BeiJing Time.
	RTC_ConvertSecondsToDatetime(seconds, &date);

    /* RTC time counter has to be stopped before setting the date & time in the TSR register */
    RTC_StopTimer(RTC);

    /* Set RTC time to default */
    RTC_SetDatetime(RTC, &date);

    /* Enable at the NVIC */
    EnableIRQ(RTC_IRQn);

    /* Start the RTC time counter */
    RTC_StartTimer(RTC);
}

static uint32_t jd_master_com_get_system_time_second(void)
{
	uint32_t currSeconds = 0;

	//transfer current seconds to UTC time.
	currSeconds = RTC->COUNT - (60*60*8);	//transfer BeiJing Time to UTC.
	return currSeconds;
}

static void jd_master_com_clear_communication_cipher(void)
{
	uint32_t eeprom_data = 0x00000000U;
	int i=0;

