zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
	dzlog_debug("%s:clear Cipher sucessful\r\n",__func__);
	//clear cipher
	for(i=0;i<8;i++){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER+(i*4),eeprom_data);
	}
	//clear flag.
	EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER_FLAG,eeprom_data);
}

static unsigned char jd_master_com_set_communication_cipher(unsigned char len,char *cipher)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	unsigned char ret = 0;	//default 0:ok.

	if(AES_KEYLEN != len){
		dzlog_error("%s:wrong key len[desired len %d but get len %d]!!!!!\r\n",
			__func__,AES_KEYLEN,len);
		ret = 1;
		return ret;
	}

	for(i=0;i<(len/4);i++){
		dzlog_debug("%s:Write EEPROM...%d Value = 0x%02X 0x%02X 0x%02X 0x%02X\r\n",__func__,
			i,cipher[i*4],cipher[i*4+1],cipher[i*4+2],cipher[i*4+3]);
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER+(i*4),
			(cipher[i*4]<<24)|(cipher[i*4+1]<<16)|(cipher[i*4+2]<<8)|cipher[i*4+3]);
	}
	//read out the cipher
	for(i=0;i<(len/4);i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_CIPHER +(i*4)));
		if(eeprom_data != ((cipher[i*4]<<24)|(cipher[i*4+1]<<16)|(cipher[i*4+2]<<8)|cipher[i*4+3])){
			dzlog_error("%s:Read EEPROM error...%d eeprom_Value = 0x%X,origin_Value = %02x %02x %02x %02x\r\n",
				__func__,i,eeprom_data,cipher[i*4],cipher[i*4+1],cipher[i*4+2],cipher[i*4+3]);
			ret = 1;
			break;
		}
	}
	//set the valid flag if write cipher ok.
	if(ret==0){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER_FLAG,EEPROM_CIPGER_FLAG_VALID);
		dzlog_debug("%s:Write Cipher to EEPROM sucessful\r\n",__func__);
	}
	return ret;
}

static bool jd_master_com_get_communication_cipher(unsigned char len,unsigned char *cipher)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	bool cipherSet = false;

	eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_CIPHER_FLAG));
	if(eeprom_data == EEPROM_CIPGER_FLAG_VALID){
		for(i=0;i<(len/4);i++){
			eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_CIPHER+(i*4)));
			cipher[i*4] = (eeprom_data>>24)&0xFF;
			cipher[i*4+1] = (eeprom_data>>16)&0xFF;
			cipher[i*4+2] = (eeprom_data>>8)&0xFF;
			cipher[i*4+3] = eeprom_data&0xFF;
		}
		cipherSet = true;
	}
	return cipherSet;
}

static unsigned char jd_master_com_set_dev_sn(unsigned char *sn)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	unsigned char tmp_sn[12];
	int i=0;
	unsigned char ret = 0;	//default 0:ok.

	memset(tmp_sn,0,sizeof(tmp_sn));
	memcpy(tmp_sn,sn,10);
	for(i=0;i<10;i++){
		dzlog_debug("%s:Write EEPROM...%d Value = 0x%02X\r\n",__func__,i,tmp_sn[i]);
	}

	//write the sn into eeprom
	for(i=0;i<3;i++){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_SN+(i*4),
			(tmp_sn[i*4]<<24)|(tmp_sn[i*4+1]<<16)|(tmp_sn[i*4+2]<<8)|tmp_sn[i*4+3]);
	}

	//read out the sn from eeprom
	for(i=0;i<3;i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_SN +(i*4)));
		if(eeprom_data != ((tmp_sn[i*4]<<24)|(tmp_sn[i*4+1]<<16)|(tmp_sn[i*4+2]<<8)|tmp_sn[i*4+3])){
			dzlog_error("%s:Read EEPROM error...%d eeprom_Value = 0x%X,origin_Value = %02x %02x %02x %02x\r\n",
				__func__,i,eeprom_data,tmp_sn[i*4],tmp_sn[i*4+1],tmp_sn[i*4+2],tmp_sn[i*4+3]);
			ret = 1;
			break;
		}
	}
	//set the valid flag if write sn ok.
	if(ret==0){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_SN_FLAG,EEPROM_SN_VALID_FLAG);
		dzlog_debug("%s:Write SN to EEPROM sucessful\r\n",__func__);
	}
	return ret;
}

bool jd_master_com_get_dev_sn(unsigned char *sn)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	unsigned char tmp_sn[12];
	bool snSet = false;

	eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_SN_FLAG));
	if(eeprom_data == EEPROM_SN_VALID_FLAG){
		for(i=0;i<3;i++){
			eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_SN +(i*4)));
			tmp_sn[i*4] = (eeprom_data>>24)&0xFF;
			tmp_sn[i*4+1] = (eeprom_data>>16)&0xFF;
			tmp_sn[i*4+2] = (eeprom_data>>8)&0xFF;
			tmp_sn[i*4+3] = eeprom_data&0xFF;
		}
		if(sn != NULL)
			memcpy(sn,tmp_sn,10);
		snSet = true;
	}

	return snSet;
}

static unsigned char jd_master_com_set_dev_id(char *device_id)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	unsigned char tmp_dev_id[DEVICE_ID_LEN+1];
	int i=0;
	unsigned char ret = 0;	//default 0:ok.

	memset(tmp_dev_id,0,sizeof(tmp_dev_id));
	memcpy(tmp_dev_id,device_id,DEVICE_ID_LEN);
	for(i=0;i<DEVICE_ID_LEN;i++){
		dzlog_debug("%s:Write EEPROM...%d Value = %c\r\n",__func__,i,(char)tmp_dev_id[i]);
	}

	//write the device id into eeprom
	for(i=0;i<(DEVICE_ID_LEN/4);i++){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_DEVID+(i*4),
			(tmp_dev_id[i*4]<<24)|(tmp_dev_id[i*4+1]<<16)|(tmp_dev_id[i*4+2]<<8)|tmp_dev_id[i*4+3]);
	}

	//read out the device id from eeprom
	for(i=0;i<(DEVICE_ID_LEN/4);i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_DEVID +(i*4)));
		if(eeprom_data != ((tmp_dev_id[i*4]<<24)|(tmp_dev_id[i*4+1]<<16)|(tmp_dev_id[i*4+2]<<8)|tmp_dev_id[i*4+3])){
			dzlog_error("%s:Read EEPROM error...%d eeprom_Value = 0x%X,origin_Value = %02x %02x %02x %02x\r\n",
				__func__,i,eeprom_data,tmp_dev_id[i*4],tmp_dev_id[i*4+1],tmp_dev_id[i*4+2],tmp_dev_id[i*4+3]);
			ret = 1;
			break;
		}
	}
	//set the valid flag if write device id ok.
	if(ret==0){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_DEVID_FLAG,EEPROM_DEVID_FLAG_VALID);
		dzlog_debug("%s:Write DeviceId to EEPROM sucessful\r\n",__func__);
	}
	return ret;
}

static bool jd_master_com_get_dev_id(unsigned char *device_id)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	unsigned char tmp_dev_id[DEVICE_ID_LEN+1];
	bool devIdSet = false;

	eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_DEVID_FLAG));
	if(eeprom_data == EEPROM_DEVID_FLAG_VALID){
		for(i=0;i<(DEVICE_ID_LEN/4);i++){
			eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_DEVID +(i*4)));
			tmp_dev_id[i*4] = (eeprom_data>>24)&0xFF;
			tmp_dev_id[i*4+1] = (eeprom_data>>16)&0xFF;
			tmp_dev_id[i*4+2] = (eeprom_data>>8)&0xFF;
			tmp_dev_id[i*4+3] = eeprom_data&0xFF;
		}
		memcpy(device_id,tmp_dev_id,DEVICE_ID_LEN);
		devIdSet = true;
	}

	return devIdSet;
}

static void jd_master_com_get_hw_ver(jd_om_comm *hdl,unsigned char *hw_ver)
{
	hw_ver[0] = hdl->hw_ver[0];
	hw_ver[1] = hdl->hw_ver[1];
	hw_ver[2] = hdl->hw_ver[2];
	hw_ver[3] = hdl->hw_ver[3];
}

static void jd_master_com_get_fw_ver(unsigned char *fw_ver)
{
	fetch_fw_ver(fw_ver);
}

static void jd_master_get_volume_level(unsigned char vol/*input:0~31*/,voice_volume_level *out_lvl)
{
	int i;

