zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
		slave = head->slave;
		sprintf(slave_addr, "0.%d.0", slave);
		to_addr.addr = tlc_iaddr(slave_addr);

		active_req = head->type;

		dzlog_debug("send msg\r\n");
		cnt_resend = 1;
RESEND_DATA:
		send_err = 0;
		print_hex((char *)__func__, pt, lens);
		ret = jd_om_send(hdl, &to_addr, pt, lens, 0);

		if (ret <= 0) {
			dzlog_error("send fail count %d\r\n", cnt_resend);

			if (res == RES_DEVICE_INFO) {
				if (cnt_resend++ <= 3) {
					jd_om_msleep(500);
					goto RESEND_DATA;
				}
			}
			send_err = 1;
		}
		//dzlog_debug("send msg completed\r\n");
		jd_om_free(pt);
		if (send_err)
			send_err_recovery(hdl,active_req);
	}
}

/*!
 * @brief uart receive Task responsible for loopback.
 */
void uart_recv_task(void const *p)
{
	jd_om_comm *uart_hdl = (jd_om_comm *)p;
	int r_len;
	jd_om_comm_addr from_addr;
	char buf[MAX_QUEUE_ELEMENT_SIZE] = { 0 };
	char *pt;
	dzlog_debug("uart_recv_task start>>>\r\n");

	//task of receving.
	while (1) {
		memset(buf, 0, MAX_QUEUE_ELEMENT_SIZE);

		r_len = jd_om_recv(uart_hdl, &from_addr, buf, MAX_QUEUE_ELEMENT_SIZE);
		if (r_len)
			dump_buffer(buf, r_len);
		if ((r_len > sizeof(MSG_UART_HEAD_T)) ||
			((r_len == strlen(ReqNameByAT)) && (strncmp(buf,ReqNameByAT,r_len)==0))) {
			print_hex((char *)__func__,buf, r_len);
			pt = jd_om_malloc(r_len);
			memcpy(pt, buf, r_len);
			jd_om_mq_send(&(uart_hdl->uart_comm_des.recv_queue), pt);
			//dzlog_debug("%s:send recv queue end...\r\n",__func__);
		}
		else{
			dzlog_error("recv msg from uart. invalid len:%d\r\n", r_len);
		}
	}
}

#if 0
void eeprom_setting_show_test(void)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;

	dzlog_info("\r\n");
	for(i=0;i<(EEPROM_ADDR_END/4);i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + (i*4)));
		dzlog_info("%s::::::[%02x %02x %02x %02x][byte %d]\r\n",__func__,
			(eeprom_data>>24)&0xFF,
			(eeprom_data>>16)&0xFF,
			(eeprom_data>>8)&0xFF,
			eeprom_data&0xFF,
			i*4);
	}
}
#endif

void uart_send_data(jd_om_comm *p, void *pt)
{
	jd_om_comm *hdl = (jd_om_comm *)p;
	int slave = SLAVE_1;
	int ret;
	int lens;
	//void *pt = NULL;
	jd_om_comm_addr to_addr;
	char slave_addr[16] = { 0 };
	int cnt_resend = 0;
	int send_err = 0;
	unsigned char active_req = 0;
	char buf[128] = { 0 };

#if 0
	while(1) {
		//osDelay(1000);
		//jz_uart_write_ex(0, "hello\r\n", 7, 1000);
		memset(buf, 128, 0);
		ret = jz_uart_read_ex(0, buf, 128, 1000);
		if (ret)
			print_hex((char *)__func__,buf, ret);
			//printf("recv : %s\r\n", buf);
		else
			printf("recv no data\r\n");
	}
#endif
	//while (1) {
		MSG_UART_HEAD_T *head = NULL;
		char res;
#if 0
		jd_om_mq_recv(&(hdl->uart_comm_des.send_queue), (void **)&pt, 0);
		if(pt == NULL){
			dzlog_error("%s: invalid message: NULL\r\n",__func__);
			continue;
		}
#endif
		head = (MSG_UART_HEAD_T *)pt;
		lens = sizeof(MSG_UART_HEAD_T) + head->payload_len + CHECKSUM_SIZE;
		//print_hex((char *)__func__,pt, lens);
		res = head->type;
		if (!is_res_type_valid(res)) {
			dzlog_error("invalid request 0x%02x\r\n", res);
			jd_om_free(pt);
			return ;
		}

		slave = head->slave;
		sprintf(slave_addr, "0.%d.0", slave);
		to_addr.addr = tlc_iaddr(slave_addr);

		active_req = head->type;

		dzlog_debug("send msg\r\n");
		cnt_resend = 1;
RESEND_DATA:
		send_err = 0;
		print_hex((char *)__func__, pt, lens);
		ret = jd_om_send(hdl, &to_addr, pt, lens, 0);

		if (ret <= 0) {
			dzlog_error("send fail count %d\r\n", cnt_resend);

			if (res == RES_DEVICE_INFO) {
				if (cnt_resend++ <= 3) {
					jd_om_msleep(500);
					goto RESEND_DATA;
				}
			}
			send_err = 1;
		}
		//dzlog_debug("send msg completed\r\n");
		jd_om_free(pt);
		if (send_err)
			send_err_recovery(hdl,active_req);
	//}
}


static osStatus uart_send_exception_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	osStatus ret;

	res_type = (type&0x0F)|0xA0;
	payload_size = sizeof(RES_COMMON_T);

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	uart_send_data(hdl, pkt);

#if 0
	ret = jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);
#endif
	return ret;
}

static osStatus uart_send_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	unsigned int material_num = 0;
	osStatus ret;

	switch (type) {

	case REQ_GET_TIME:
	{
		res_type = RES_GET_TIME;
		payload_size = sizeof(RES_GET_TIME_T);
		break;
	}

	default:
		return osErrorOS;
	}

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);
	uart_send_data(hdl, pkt);

	return ret;
}


static char uart_data_dispatch(jd_om_comm *hdl,char *pt,bool *file_trans,UINT *trans_timeout_cnt)
{
	char payload[MAX_QUEUE_ELEMENT_SIZE] = { 0 };
	MSG_UART_HEAD_T* head = (MSG_UART_HEAD_T*)pt;
	static unsigned char last_session_id = -1;
	static unsigned int old_pkt_id = 1;
	unsigned int payload_len = 0;
	unsigned char type;

	bool has_send_res = false;

	// 获取start字段
	unsigned char start = head->start;

	//	判断start字段值是否正�?
	if (START_CMD != start) {
		dzlog_error("recv invalid packet\r\n");
		has_send_res = true;	//don't send res as invalid start code.
		goto FREE;
	}

